readme.org
#+AUTHOR: iwahbe
#+PROPERTY: header-args :noweb no-export :mkdirp t
#+PROPERTY: header-args:emacs-lisp :tangle .emacs.d/init.el
#+PROPERTY: header-args:zsh :tangle .zshrc :shebang "#!/bin/zsh"

* Literate Configuration

We want to be able to treat this file especially, so we need to set its name in a variable.

#+BEGIN_SRC emacs-lisp :var this-file=(buffer-file-name)
(defvar =literate-config-file this-file
  "The file that this config was tangled from.")
#+END_SRC

Common file types have common headers and footers. [[help:org-babel-tangle][org-babel-tangle]] has support for post-tangle hooks, but doesn't expose a framework for such hooks. We want such a framework.

Org-babel exposes [[help:org-babel-post-tangle-hook][org-babel-post-tangle-hook]]. We can build a macro on top of that to create easy finalize hooks.

#+BEGIN_SRC emacs-lisp
(defmacro =config-tangle-finalize (&rest body)
  "Define a function to run after tangling a file in this directory.

The first argument to BODY specifies the condition to run the
hook.  Available patterns are:

- (`:ext' EXT): EXT is a symbol that defines the extension for the file.
- (`:name' NAME): NAME is a symbol that specifies the full name of the file.
- (`or' PAT1 ... PATN): PAT_I is one of the available patterns."
  (declare (indent defun))
  (let ((f `(buffer-file-name)))
    `(add-hook 'org-babel-post-tangle-hook
	       (lambda ()
		 (when (and
			(string-prefix-p (expand-file-name
					  (file-name-directory =literate-config-file))
					 ,f)
			,(=config--tangle-condition (car body) f))
		   ,@(cdr body)
		   ;; We need to save the buffer, since this hook runs after the initial
		   ;; babel save
		   (let ((save-silently t) before-save-hook)
		     (save-buffer)))))))
#+END_SRC

The bulk of the work is parsing the condition. We need to define a separate function here because the definition is recursive.

#+BEGIN_SRC emacs-lisp
(defun =config--tangle-condition (condition file-name)
  "Parse CONDITION into a callable function.
FILE-NAME evaluates to the file name under consideration."
  (pcase condition
    (`(:ext ,ext) `(equal (file-name-extension ,file-name t) (symbol-name ',ext)))
    (`(:name ,name) `(equal (file-name-nondirectory ,file-name) (symbol-name ',name)))
    (`(or . ,l) `(or ,@(mapcar (lambda (x) (=config--tangle-condition x file-name)) l)))
    (other (error "Unknown condition: '%s'" other))))
#+END_SRC


Referencing and editing our configuration is a common action (for good or for ill). We bind config navigation.

#+BEGIN_SRC emacs-lisp
(defun =config-heading ()
  "Jump to a config heading."
  (interactive)
  (require 'org)
  (org-overview)
  (consult-org-heading nil `(,=literate-config-file))
  (org-reveal)
  (org-fold-show-subtree))

(global-set-key (kbd "C-c C") #'=config-heading)
#+END_SRC

We don't actually want to tangle this file into its surrounding directory. We want to tangle it into the output directory.

#+BEGIN_SRC emacs-lisp
(advice-add #'org-babel-effective-tangled-filename :around
	    (lambda (fn buffer-fn src-lang src-tfile)
	      "Ensure that all files tangled from readme.org are emmited to the output directory."
	      (let ((v (funcall fn buffer-fn src-lang src-tfile)))
		(if (and v (equal buffer-fn "readme.org")
			 (not (string-prefix-p "bin/" src-tfile)))
		    (concat "output/" v)
		  v))))
#+END_SRC

** CLI
#+PROPERTY: header-args:sh :tangle bin/config :shebang "#!/bin/sh"

We want to provide a script to link generated files into the main directory. Instead of trying to track the files generated during tangling, we provide a simple =sh= script to recursively traverse a directory, adding symlinks as appropriate. We do this with a script instead of a =emacs-lisp= function to ensure that tangled artifacts can be produced without a fully configured Emacs instance.

We begin by defining our /action/ functions. These are the functions that will actually perform work.

#+BEGIN_SRC sh
# make_link <src> <dst>
#
# Create a link between <src> and <dst>.
# <src> may be a directory.
# <dst> will not exist.
#
# You can override the command used by setting CONFIG_LINK_CMD.
make_link () {
    if [[ "" == "$CONFIG_LINK_CMD" ]]; then
	echo "Linking $1 to $2: done"
	ln -s -w $1 $2
    else
	$CONFIG_LINK_CMD $1 $2
    fi
}

# unmake_link <src> <dst>
#
# Remove an existing link from <src> to <dst>.
#
# You can override the command used by setting CONFIG_UNLINK_CMD.
unmake_link() {
    if [[ "" == "$CONFIG_UNLINK_CMD" ]]; then
	echo "Unlinking $1 from $2: done"
	rm $2
    else
	$CONFIG_UNLINK_CMD $1 $2
    fi
}

# skip_link <src> <dst>
#
# Skip linking from <src> to <dst> because <dst> already exists.
skip_link() {
    # echo "skiping linking $1 to $2"
    true # Necessary because empty functions are not allowed in sh scripts.
}
#+END_SRC

We define defaults for both =$SRC_DIR= and =$DST_DIR=. We define them separately because we will show these defaults in our help message.

#+BEGIN_SRC sh
SRC_DEFAULT_DIR="$PWD/output" # This is chosen so running bin/config up "just works"

DST_DEFAULT_DIR="$HOME"
#+END_SRC

We then define our =$HELP= variable, using [[https://tldp.org/LDP/abs/html/here-docs.html][heredoc]].

#+BEGIN_SRC sh
read -r -d '' HELP <<- EOF
	config [cmd] [src=$SRC_DEFAULT_DIR] [dst=$DST_DEFAULT_DIR]

	Recursivly link src to dst. Effert is made to make the minimum number of links.
	That means that directories are linked if possible, otherwise their content is recursed.

	Files in dst are prioritized over files in src.

	Both src and dst must be directories.
EOF
#+END_SRC

Here we translate our CLI arguments =$1= (=[src]=) and =$2= (=[dst]=) into local variables, initialize them to their default values, or make relative paths absolute.

#+BEGIN_SRC sh
SRC_DIR=$2
DST_DIR=$3

if [[ "$SRC_DIR" == "" ]]; then
    # If the source directory is empty, apply the default.
    SRC_DIR="$SRC_DEFAULT_DIR"
elif [[ ! "$SRC_DIR" == /* ]]; then
    # If the source directory doesn't start with a slash, prefix it with the current
    # directory
    SRC_DIR="$PWD/$SRC_DIR"
fi

if [[ "$DST_DIR" == "" ]]; then
    DST_DIR="$DST_DEFAULT_DIR"
elif [[ ! "$DST_DIR" == /* ]]; then
     # If a relative directory was given, set it relative to the current directory.
     DST_DIR="$PWD/$DST_DIR"
fi
#+END_SRC

If they were not initialized to valid directories, then the user made a mistake invoking the command. We show help and exit.

#+BEGIN_SRC sh
if [[ ! -d "$SRC_DIR" ]]; then
    echo "'$SRC_DIR' is not a directory"
    echo
    echo "$HELP"
    exit 1
fi

if [[ ! -d "$DST_DIR" ]]; then
    echo "'$DST_DIR' is not a directory"
    echo
    echo "$HELP"
    exit 1
fi
#+END_SRC

=stand_up= implements the recursive linker. The algorithm is simple:

For a directory, check
- If the destination does not exist, link it and return.
- If the destination is a directory and the source is a directory, recurse
- If the destination is already linked to the source, return.
- Otherwise skip the link and return.

#+BEGIN_SRC sh
# stand_up <path>
stand_up () {
    if [[ ! -e "$DST_DIR/$1" ]] && [[ ! -L "$DST_DIR/$1" ]]; then
	# dst doesn't exist, so link the entry.  This can be either a file or a
	# directory.
	make_link "$SRC_DIR/$1" "$DST_DIR/$1"
    elif [[ -d "$DST_DIR/$1" ]] && [[ -d "$SRC_DIR/$1" ]]; then
	# The dst directory exists,
	for entry in $('ls' -a "$SRC_DIR/$1"); do
	    if [[ "$entry" == "." ]] || [[ "$entry" == ".." ]]; then
		true # do nothing here
	    elif [[ "$1" == "" ]]; then
		stand_up "$entry"
	    else
		stand_up "$1/$entry"
            fi
	done
    elif [[ -L "$DST_DIR/$1" ]] && [[ "$(readlink $DST_DIR/$1)" == "$SRC_DIR/$1" ]]; then
	echo "Linking $DST_DIR/$1: already linked"
    else
	# We can't recurse down directories, so we give up
	skip_link "$SRC_DIR/$1" "$DST_DIR/$1"
    fi
}
#+END_SRC

=tear_down= implements the algorithm for recursively removing links. The algorithm goes:

For a directory:
- If the destination is a link to the source, remove the link and return.
- Otherwise if the source and destination are directories, recurse into the directory.

#+BEGIN_SRC sh
# tear_down <path>
tear_down () {
    if [[ -L "$DST_DIR/$1" ]] && [[ "$(readlink $DST_DIR/$1)" == "$SRC_DIR/$1" ]]; then
	# Its a link to the file in our tree
	unmake_link "$SRC_DIR/$1" "$DST_DIR/$1"
    elif [[ -d "$DST_DIR/$1" ]] && [[ -d "$SRC_DIR/$1" ]]; then
	# The dst directory exists,
	for entry in $('ls' -a "$SRC_DIR/$1"); do
	    if [[ "$entry" == "." ]] || [[ "$entry" == ".." ]]; then
		true # do nothing here
	    elif [[ "$1" == "" ]]; then
		tear_down "$entry"
	    else
		tear_down "$1/$entry"
	    fi
	done
    fi
}
#+END_SRC

Finally, we have a switch statement that controls the command's execution.

#+BEGIN_SRC sh
case $1 in
    up)
	stand_up ""
	;;
    down)
	tear_down ""
	;;
    ,*)
	echo "Unknown command \"$1\""
	echo ""
	echo "$HELP"
	;;
esac
#+END_SRC

* Emacs
** Getting Started

*** Installation

On mac, I use [[https://github.com/d12frosted/homebrew-emacs-plus][homebrew-emacs-plus]] to install Emacs. This is the command I used to install.

#+BEGIN_SRC sh :tangle bin/brew.sh
brew install emacs-plus@29     \
     --with-no-frame-refocus   \
     --with-imagemagick        \
     --with-native-comp        \
     --with-poll               \
     --with-memeplex-wide-icon
#+END_SRC

** Literate Configuration

This is a [[http://www.literateprogramming.com][literate]] [[help:user-emacs-directory][config]] for Emacs. This file is the single source of truth for the contents of =.emacs.d=.

We want all =emacs-lisp= files to be tangled with the appropriate headers and footers.

- Emacs would like each file to declare its module, and a description.
- All files should use lexical bindings. This makes the code easier to read, and easier for Emacs to interpret, leading to a performance boost.
- Emacs would like each file to declare its end.

#+BEGIN_SRC emacs-lisp
(=config-tangle-finalize (:ext .el)
  (let ((feature (string-remove-suffix
		  ".el" (string-remove-prefix
			 (expand-file-name user-emacs-directory)
			 (buffer-file-name)))))
    ;; Insert the header
    (goto-char (point-min))
    (insert ";;; " feature ".el --- Tangled from init.org -*- lexical-binding: t; -*-\n"
	    "\n"
	    ";;; Commentary:\n"
	    "\n"
	    ";; This file was tangled as part of iwahbe's Emacs config.\n"
	    "\n"
	    ";;; Code:\n"
	    "\n")
    ;; Then insert the footer
    (goto-char (point-max))
    (insert "\n"
	    "(provide '" feature ")\n"
	    ";;; " feature ".el ends here\n"))
  (lisp-indent-region (point-min) (point-max)))
#+END_SRC

Further, we want lexical bindings even when developing interactively. This doesn't do anything when a file is loaded, but it does effect what happens when =eval-last-sexp= is used.

#+BEGIN_SRC emacs-lisp
(setq-default lexical-binding t)
#+END_SRC

I declare a custom helper macro for adding hooks. It simplifies quoting, and allows multiple hooks to be attached in a single /sexp/.

#+BEGIN_SRC emacs-lisp
(defmacro =add-hook (mode &rest hooks)
  "Attach multiple HOOKS to a MODE hook.
It is optional to quote MODE."
  (declare (indent defun))
  `(progn
     ,@(mapcar
	(lambda (hook) `(add-hook
			 ,(if (eq (car-safe mode) 'quote)
			      mode
			    `(quote ,mode))
			 ,hook))
	hooks)))
#+END_SRC

==dbg= isn't used within the config, but it proves a helpful pass-through macro for debugging.

#+BEGIN_SRC emacs-lisp
(defmacro =dbg (form)
  "Print FORM => RES where res is what FORM evaluate to.
Return RES."
  `(let ((res ,form)) (message "dbg: %s => %s" '(,@form) res) res))
#+END_SRC


=(==one-of el p1 p2)= is an efficient implementation of =(memq el (list p1 ... pN))= where =p_i= is computed only for the equality check.

#+BEGIN_SRC emacs-lisp
(defmacro =one-of (el &rest forms)
  "Check if EL is one of FORMS.
The nth form in FORMS is evaluated only if no previous form matched EL.
Each form in FORMS is compared against EL with `eq'."
  (let ((name (gensym "el")))
    `(let ((,name ,el))
       (or ,@(mapcar
	      (lambda (form)
		`(eq ,name ,form))
	      forms)))))
#+END_SRC

The best way to understand how ==one-of= works is too see what it expands into:

#+BEGIN_SRC emacs-lisp :tangle no :results pp :wrap example emacs-lisp
(macroexpand-1
 `(=one-of (get-input) (comp1) (comp2) (comp3)))
#+END_SRC

#+RESULTS:
#+begin_example emacs-lisp
(let
    ((el39
      (get-input)))
  (or
   (eq el39
       (comp1))
   (eq el39
       (comp2))
   (eq el39
       (comp3))))
#+end_example

** Performance

Emacs Lisp is garbage collected. While this is generally fine, I don't need garbage collection runs kicking off during startup. I disable garbage collection during startup.

It is important that we turn off the GC as early as possible, to save as many cycles as possible.

#+BEGIN_SRC emacs-lisp :tangle .emacs.d/early-init.el
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)
#+END_SRC

We don't want to permanently disable garbage collection, so we re-enable garbage collection after all packages have been loaded.

#+BEGIN_SRC emacs-lisp
(add-hook 'elpaca-after-init-hook
	  (lambda ()
	    (setq gc-cons-threshold 16777216 ; 16mb
		  gc-cons-percentage 0.1)))
#+END_SRC

** Window + Frame Management

A quick glossary for those new to Emacs. Because Emacs predates windowed graphics systems, it uses different terminology then the rest of the world.

In Emacs parlance, the object managed by the OS windowing system is called a *frame*. Each internal pane in a /frame/ is called a *window*.

By default, Emacs thinks in terms of text columns and lines. This isn't great when computing frame sizes for graphical purposes. We want to think in pixels.

#+BEGIN_SRC emacs-lisp :tangle .emacs.d/early-init.el
(setq frame-resize-pixelwise t)
#+END_SRC

It is important to set graphical elements in =early-init.el=, since otherwise they take effect after graphics open and the window viably flickers or resizes.

#+BEGIN_SRC emacs-lisp :tangle .emacs.d/early-init.el
(tool-bar-mode -1)
(menu-bar-mode -1)
(setq
 frame-resize-pixelwise t
 ;; We set the font here to work around a bug that hides the echo area
 ;; when a font is set after the frame loads.
 default-frame-alist '((font . "Fira Code")
		       (vertical-scroll-bars . nil)
		       (horizontal-scroll-bars . nil))
 initial-frame-alist
      '((width . 0.5) (height . 1.0)
	(top . 0) (left . 1.0)))
#+END_SRC

