readme.org
** Clutter Management

We want to be able to cleanly check this file in so we direct what we can into a hidden =.cache=.

#+BEGIN_SRC emacs-lisp
(defvar =cache-directory (expand-file-name ".cache" user-emacs-directory)
  "The directory where a system local cache is stored.")

(defun =cache-subdirectory (domain)
  "A stable directory to cache files from DOMAIN in."
  (expand-file-name (concat domain "/") =cache-directory))

(defun =cache-file (file &optional domain)
  "A stable file name for FILE, located in DOMAIN if provided."
  (expand-file-name file
		    (if domain
			(let ((s (=cache-subdirectory domain)))
			  (unless (file-executable-p s)
			    (mkdir s))
			  s)
		      =cache-directory)))
#+END_SRC

In theory, it is possible to redirect =.eln= files to an arbitrary location using =startup-redirect-eln-cache=, but it hasn't worked for me. For the record, this is the block I tried:

#+BEGIN_SRC emacs-lisp :file .emacs.d/early-init.el :tangle no
(when (fboundp 'startup-redirect-eln-cache)
  (startup-redirect-eln-cache (=cache-subdirectory "eln-cache")))
#+END_SRC

Following good practice, we maintain an =assets= folder, where we store /heavy/ files.

#+BEGIN_SRC emacs-lisp
(defvar =assets-directory (expand-file-name "assets" user-emacs-directory)
  "The directory containing large runtime assets, such as images.")
#+END_SRC

Part of clutter management is keeping file buffers up to date with the underlying files. For this, we have [[help:auto-revert-mode][auto-revert-mode]].

#+BEGIN_SRC emacs-lisp
(auto-revert-mode +1)
#+END_SRC

** Package Management

I use [[https://github.com/progfolio/elpaca][elpaca]] as my package manager for Emacs. Like all package managers (except built-in =package.el=, it requires a self-install script to initialize itself.

To avoid cluttering up the =.emacs.d= directory, we have =elpaca= cache in it's own directory.

#+BEGIN_SRC emacs-lisp
(defvar elpaca-directory (=cache-subdirectory "elpaca"))
  #+END_SRC

  This is the install script from the elpaca repo:

#+BEGIN_SRC emacs-lisp
(defvar elpaca-installer-version 0.1)
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
			      :ref nil
			      :files (:defaults (:exclude "extensions"))
			      :build (:not elpaca--activate-package)))
(when-let ((repo  (expand-file-name "repos/elpaca/" elpaca-directory))
	   (build (expand-file-name "elpaca/" elpaca-builds-directory))
	   (order (cdr elpaca-order))
	   ((add-to-list 'load-path (if (file-exists-p build) build repo)))
	   ((not (file-exists-p repo))))
  (condition-case-unless-debug err
      (if-let ((buffer (pop-to-buffer-same-window "*elpaca-installer*"))
	       ((zerop (call-process "git" nil buffer t "clone"
				     (plist-get order :repo) repo)))
	       (default-directory repo)
	       ((zerop (call-process "git" nil buffer t "checkout"
				     (or (plist-get order :ref) "--"))))
	       (emacs (concat invocation-directory invocation-name))
	       ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
				     "--eval" "(byte-recompile-directory \".\" 0 'force)"))))
	  (progn (require 'elpaca)
		 (elpaca-generate-autoloads "elpaca" repo)
		 (kill-buffer buffer))
	(error "%s" (with-current-buffer buffer (buffer-string))))
    ((error) (warn "%s" err) (delete-directory repo 'recursive))))
(require 'elpaca-autoloads)
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+END_SRC

Worth noting: =elpaca= runs asynchronously, and kicks off after =after-init-hook=.

We need to disable =package.el=, Emacs's default package manager. Since =package.el= sets up existing packages before =init.el= runs, we need to do this in =early-init.el=:

#+BEGIN_SRC emacs-lisp :tangle .emacs.d/early-init.el
(setq package-enable-at-startup nil)
#+END_SRC

** Splash Screen

Half of customizing Emacs is making the splash screen look fancy.

We redefine =display-startup-echo-area-message=, since there is no built in way to disable it. To make sure I am cognizant of start-up time, I have this set to display the load time of Emacs.

#+BEGIN_SRC emacs-lisp
(defun display-startup-echo-area-message ()
  "Override the default help message by redefining the called function."
  (message "Loaded %s packages in %f seconds"
	   (length (elpaca--queued))
	   (float-time
	    (time-subtract
	     elpaca-after-init-time
	     before-init-time))))
#+END_SRC

I like the simplicity of a random Emacs-related image on screen. I'm not willing to give up on supporting text only situations (such as in the terminal). To that end, there is a fall-back option to display only text.

#+BEGIN_SRC emacs-lisp
(defun =splash-buffer (&optional window)
  "The splash screen.
It is assumed that the splash screen will occupy the whole frame
when it is created.
WINDOW is passed via `window-size-change-functions'.  It is ignored."
  (ignore window)
  (if (not (=one-of (current-buffer)
	    (get-buffer "*scratch*")
	    (get-buffer "*Splash Screen*")))
      ;; If the current buffer is not *scratch*, then Emacs was opened
      ;; onto a file, so we should just display that file.
      (current-buffer)
    (with-current-buffer (get-buffer-create "*Splash Screen*")
      (read-only-mode)
      (make-local-variable 'window-size-change-functions)
      (add-to-list 'window-size-change-functions #'=splash-buffer)
      (let ((inhibit-read-only t))
	(unless (eq (buffer-size) 0)
	  (erase-buffer))
	(if (and (display-graphic-p) (featurep 'image))
	    (=splash-buffer--graphic)
	  (=splash-buffer--text))
	(setq cursor-type nil)
	(goto-char (point-min))
	(setq mode-line-format nil)
	(current-buffer)))))
#+END_SRC

Emacs uses =initial-buffer-choice= to determine what buffer it should start in.

#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice #'=splash-buffer)
#+END_SRC

*** Graphics

Here we want to insert a random image from our list of graphic banner images. Graphic banner images are stored in the =assets= folder. We define our list of images.

#+BEGIN_SRC emacs-lisp
(defvar =emacs-graphic-banners
  (mapcar (lambda (x) (expand-file-name x =assets-directory))
	  '("gnu-head.svg"
	    "emacs-icon.svg"))
  "A list of graphical banners to open Emacs with.
Each element is expected to be the path to a SVG file.")

(defvar =emacs-graphic-banner
  (nth (random (length =emacs-graphic-banners))
       =emacs-graphic-banners)
  "The randomly chosen graphic banner to use for this session.
This is calculated once, so it doesn't change during redisplay.")
#+END_SRC

We then define what a graphic splash buffer will be: A centered image 1/3 down the frame.

#+BEGIN_SRC emacs-lisp
(defun =splash-buffer--graphic ()
  "Display the splash screen with graphics."
  (let* ((img
          ;; Each image is expected to take up 3/4 of the smallest dimension of screen
          ;; space.
          (if (>= (frame-pixel-width) (frame-pixel-height))
              (create-image
	       =emacs-graphic-banner
	       nil nil :height (round (* (frame-pixel-height) 0.75)))
	    (create-image
	     =emacs-graphic-banner
	     nil nil :width (round (* (frame-pixel-width) 0.75)))))
	 (img-size (image-size img))
	 (img-width (round (car img-size)))
	 (img-height (round (cdr img-size))))
    ;; We want to center the image around 1/3 down the
    ;; screen. Since the image insert holds the top of the
    ;; image, we need to adjust the insert point by adding
    ;; newlines.
    (insert (make-string (max (- (/ (frame-height) 3) (/ img-height 2)) 0) ?\n))
    ;; Likewise, we want to insert the image in the center of
    ;; the screen but the image inserts from the left. We pad
    ;; our insert point with spaces.
    (insert (make-string (max (- (/ (frame-width) 2) (/ img-width 2)) 0) ? ))
    (insert-image img nil nil nil t)))
    #+END_SRC

*** Text

Text banners are stored inline with in =init.el=. They were generated from [[https://patorjk.com/software/taag/#p=display&f=Graffiti&t=Emacs][patorjk.com/software/taag]].

#+BEGIN_SRC emacs-lisp
(defvar =emacs-text-banners
  '(("███████╗███╗   ███╗ █████╗  ██████╗███████╗"
     "██╔════╝████╗ ████║██╔══██╗██╔════╝██╔════╝"
     "█████╗  ██╔████╔██║███████║██║     ███████╗"
     "██╔══╝  ██║╚██╔╝██║██╔══██║██║     ╚════██║"
     "███████╗██║ ╚═╝ ██║██║  ██║╚██████╗███████║"
     "╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝╚══════╝")
    ("  _______  ___      ___       __       ______    ________  "
     " /\"     \"||\"  \\    /\"  |     /\"\"\\     /\" _  \"\\  /\"       ) "
     "(: ______) \\   \\  //   |    /    \\   (: ( \\___)(:   \\___/  "
     " \\/    |   /\\\\  \\/.    |   /' /\\  \\   \\/ \\      \\___  \\    "
     " // ___)_ |: \\.        |  //  __'  \\  //  \\ _    __/  \\\\   "
     "(:      \"||.  \\    /:  | /   /  \\\\  \\(:   _) \\  /\" \\   :)  "
     " \\_______)|___|\\__/|___|(___/    \\___)\\_______)(_______/   "))
  "A list of non-graphical banners.
Each banner is expected to be a list of text, where each text
element is a single line.")

(defvar =emacs-text-banner
  (nth (random (length =emacs-text-banners)) =emacs-text-banners)
  "The text banner to use for this session.
This is calculated once so it doesn't change during redisplay")
#+END_SRC

The display function is similar to the graphic version, aiming to put the text centered 1/3 down the frame.

#+BEGIN_SRC emacs-lisp
(defun =splash-buffer--text ()
  "Display the splash screen with only text."
  (let ((banner =emacs-text-banner)
	(empty-line "\n"))
    (dotimes (_ (- (/ (frame-height) 3) (/ (length banner) 2) 2))
      (insert empty-line))
    (mapc (lambda (x) (insert x "\n")) banner))
  (let ((fill-column (frame-width)))
    (center-region (point-min) (point-max))))
#+END_SRC

** UX

I understand what the scratch buffer does, so the explanation is not necessary.

#+begin_src emacs-lisp
(setq initial-scratch-message nil)
#+end_src

I don't need the additional delay of typing "es" or "o". "y" or "n" is sufficient.

#+BEGIN_SRC emacs-lisp
(fset #'yes-or-no-p #'y-or-n-p)
#+END_SRC

Text editors should not make sound.

#+BEGIN_SRC emacs-lisp
(setq ring-bell-function #'ignore)
#+END_SRC

Emacs disables /dangerous/ commands by default in  interactive contexts. I like to live dangerously (with copious use of version control).

#+BEGIN_SRC emacs-lisp
(setq disabled-command-function nil)
#+END_SRC

In general, Emacs should follow symlinks. If it has reason to believe this is a bad idea, it should warn but not halt my workflow.

#+BEGIN_SRC emacs-lisp
(setq vc-follow-symlinks t)
#+END_SRC

Spaces vs tabs is the forever war. I have no stake in this race, except that some environments struggle to correctly display tabs. Fewer struggle with spaces. If this needs to be different for specific major modes, they can override it.

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC

Recursive minibuffers are often helpful.

#+BEGIN_SRC emacs-lisp
(setq enable-recursive-minibuffers t)
#+END_SRC

*** Desktop

We don't enable =desktop= to handle restoring place after exiting. There are two blocking problems:
1. =desktop= doesn't lead to a consistent restore of all buffers.
2. =desktop= also slows down loading by about 3 seconds, which is unacceptable.

#+BEGIN_SRC emacs-lisp :tangle no
(setq desktop-path (list (=cache-subdirectory "desktop")))
(desktop-save-mode +1)
#+END_SRC

*** Theme

Emacs uses a concept called a =theme= to control system appearance. Each theme applies a layer of =face= description to the loaded buffer. The ordered list of enabled themes is defined in =custom-enabled-themes=.

When I load a theme, I only want that theme to apply. I don't want the previous theme to effect the current experience. To solve this, I define a =load-theme= wrapper called ==load-theme=.

#+BEGIN_SRC emacs-lisp
(defun =load-theme (theme)
  "Load THEME without asking for permission."
  (interactive
   (list (intern (completing-read "Load custom theme: "
                                  (mapcar #'symbol-name
				          (custom-available-themes))
                                  nil t))))
  (load-theme (pcase theme
		('light 'spacemacs-light)
		('dark 'spacemacs-dark)
		(other other))
	      t)
  ;; Disable previous themes
  (mapc #'disable-theme (cdr custom-enabled-themes)))
#+END_SRC

I'm currently using [[https://github.com/nashamri/spacemacs-theme][spacemacs-theme]], both light and dark as my goto-theme.

#+BEGIN_SRC emacs-lisp
;; Currently, running this theme generates warnings.  This fix is:
;; https://github.com/nashamri/spacemacs-theme/pull/200
(elpaca spacemacs-theme
#+END_SRC

Mac has a concept of light and dark mode at the system level. Emacs can be built with hooks to support system appearance change. I want use these hooks when available.

#+BEGIN_SRC emacs-lisp
  (if (boundp 'ns-system-appearance)
      (=add-hook ns-system-appearance-change-functions #'=load-theme)
#+END_SRC

When there isn't any system input for the theme, we will just load the ='light= theme by default.

#+BEGIN_SRC emacs-lisp
    (=load-theme 'light)))
#+END_SRC

*** Cursor

I expect the cursor to be static, and I prefer a bar over a block.

#+BEGIN_SRC emacs-lisp
(setq-default cursor-type 'bar)
(blink-cursor-mode -1)
#+END_SRC

