early-init.el

  (setq package-enable-at-startup nil)
